TestCase/DeconvolutionBased/DC_50_DB_CLASSIC/0.orig/T_template
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0  1 0 0 0];


internalField   uniform 300;

boundaryField
{
    top
    {
        type           fixedGradient;
	gradient uniform -0.00981;
    }
    bottom
    {
        type            fixedGradient;
	gradient	uniform 0.00981;
    }
    left
    {
        type            zeroGradient;
    }
    right
    {
         type           zeroGradient;
    }
    frontandback
    {
        type            empty;
    }
}


// ************************************************************************* //
